<a href="https://colab.research.google.com/github/rajansingh387/assignments/blob/main/Mysql_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Q1. What is a database? Differentiate between SQL and NoSQL databases.


a database is a memory or place where we store various types of data and where we  can perform varius task on that data like analyzing, editing etc. database provides a way to store and manage large amounts of data without ruining data's  integrity.

sql databases follow a structured, tabular data model. data is stored in tables with predefined schemas where each row represents a record, and columns represent features of that record.
sql databases typically support acid

(Atomicity, Consistency, Isolation, Durability)

 transactions, which ensure data integrity and consistency even in the presence of failures.

 nosql databases offer a variety of data models, such as document based, key value,column family, and graph based. these models are more flexible,allowing developers to choose the best fit for their data.

 i summary sql database are best suited for projects or applications where you need structured data, where it is necessory to maintain acid properties. no sql databases are best suited for projects where data is not in structured format and where data changes rapidly.

Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

Data Definition Language statements are used to create, modify, and delete database objects such as tables, indexes, and views.
it is a subset of SQL

In [ ]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.8.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.20)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (67.7.2)
Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.19.0)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.39)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)

In [ ]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

the create statement is used to create new database objects, such as tables, indexes, views, and more.

In [ ]:
%%sql

CREATE TABLE Students (
    StudentID INT PRIMARY KEY,
    FirstName TEXT,
    LastName TEXT,
    Age INT
);

-- Insert data into the table
INSERT INTO Students (StudentID, FirstName, LastName, Age)
VALUES (1, 'John', 'Doe', 20),
       (2, 'Jane', 'Smith', 22),
       (3, 'Michael', 'Johnson', 21);

-- Retrieve data from the table
SELECT * FROM Students;

 * sqlite://
Done.
3 rows affected.
Done.

[(1, 'John', 'Doe', 20),
 (2, 'Jane', 'Smith', 22),
 (3, 'Michael', 'Johnson', 21)]

 alter statement is used to modify existing database objects. It can be used to add, modify, or drop columns, constraints, and more within a table.

In [ ]:
%%sql
ALTER TABLE students
ADD oom VARCHAR(20);

 * sqlite://
Done.

[]

 truncate statement is used to remove all data from a table, while keeping the structure intact. this sytax won't work in colab because we are using sqlit

In [ ]:
%%sql
TRUNCATE table students;

 * sqlite://
(sqlite3.OperationalError) near "TRUNCATE": syntax error
[SQL: TRUNCATE table students;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

drop statement is used to delete a table,index, database etc

In [ ]:
%%sql
drop table students

 * sqlite://
Done.

[]

Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.

dml statements are used to insert,update, and delete data within database tables. it is a subset of sql which is used to interact with and manipulate the data stored within a database.

In [ ]:
%%sql
CREATE TABLE Students (
    StudentID INT PRIMARY KEY,
    FirstName TEXT,
    LastName TEXT,
    Age INT
);

insert statement is used to insert data into tables,you can insert data into specific columns or all columns, depending on your needs

In [ ]:
%%sql
INSERT INTO students (StudentID, FirstName, LastName, Age)
VALUES (1, 'rajan', 'singh', 18);

 * sqlite://
1 rows affected.

[]

In [ ]:
%%sql
select * from students;

 * sqlite://
Done.

[(1, 'rajan', 'singh', 18)]

update statement is used to modify existing data in a table. you can update specific rows that match a certain condition.

In [ ]:
%%sql
UPDATE students
SET firstname = 'megha'
WHERE studentid = 1;

 * sqlite://
1 rows affected.

[]

In [ ]:
%%sql
select * from students
where studentid=1;

 * sqlite://
Done.

[(1, 'megha', 'singh', 18)]

In [ ]:
%%sql

UPDATE students
SET FirstName = LastName
WHERE StudentID = 1;

 * sqlite://
1 rows affected.

[]

In [ ]:
%%sql
select * from students
where studentid=1;

 * sqlite://
Done.

[(1, 'singh', 'singh', 18)]

Q4. What is DQL? Explain SELECT with an example.

DQL focuses on querying the database to retrieve specific information without modifying the data itself. main dql statement is the SELECT statement, which allows you to retrieve data from one or more tables based on specified criteria.

In [ ]:
%%sql
select firstname from students;

 * sqlite://
Done.

[('singh',)]

In [ ]:
%%sql
select age from students;

 * sqlite://
Done.

[(18,)]

Q5. Explain Primary Key and Foreign Key.

a primary key is a column or a set of columns in a database table that uniquely identifies each row in that table. a primary key constraint enforces the uniqueness and non-null property of the key columns

In [ ]:
%%sql
drop table rajan

 * sqlite://
Done.

[]

In [ ]:
%%sql
create table rajan (
  id int primary key,
  name varchar(30),
  age int
);

 * sqlite://
Done.

[]

a foreign key is a column in a database table that establishes a link between data in two tables. It creates a relationship between tables by referencing the primary key of another table.

In [ ]:
%%sql
CREATE TABLE Enrollments (
    StudentName VARCHAR(50),
    id int,
    FOREIGN KEY (id) REFERENCES rajan(id)
)

 * sqlite://
Done.

[]

In [ ]:
%%sql
select * from enrollments

 * sqlite://
Done.

[]

Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

A cursor is an object that allows you to execute SQL queries and fetch results from the database. You create a cursor using mydb.cursor

you use the execute method of the cursor to execute SQL queries using the cursor object

In [ ]:
import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="abc",
  password="password"
)
mycursor = mydb.cursor()
#mycursor.execute("select * from test2.test_table")
mycursor.execute("select c1 , c5 from test2.test_table")
for i in mycursor.fetchall() :
    print(i)

mydb.close()

Q7. Give the order of execution of SQL clauses in an SQL query.

FROM
WHERE
GROUP BY
HAVING
ORDER BY